class Messages:

    add = '➕ Добавить'

    undo_accept = '❌ Отменить добавление'
    undo_delete = '❌ Отменить удаление'

    canceled = 'Отменено'
    commands = '✒ Команды'

    delete = '❌ Удалить'

    empty_manga_list = 'У вас еще нет списка манги'
    error_try_again = 'Ошибка, попробуйте снова'

    data_error = 'Ошибка, проверьте правильность данных для {}'
    detailed_search_is_started = 'Включаю детальный поиск'
    dont_have_such_manga = 'У вас нет манги с id = {}'

    fast_search_is_started = 'Включаю турбо поиск'

    get_subscribed_list = '📚 Список манги'
    manga_sucsesfully_added = 'Манга {} успешно добавлена!'
    my_commands = 'Мои команды такие:\n' \
                  '➕/add - добавляет новую мангу по ссылке в твой список\n' \
                  '❌/delete - удаляет мангу по айди из твоего списка\n' \
                  '📚/getsubscribed - выводит список твоей манги\n' \
                  '🔎/refresh - говорит тебе что обновилось в твоем списке\n' \
                  '🖊/help - выводит мои команды'

    new_chapters_already = 'Вышли новые главы:\n'

    refresh = '🔎 Обновить'

    search_is_started = 'Я началь искать...'
    search_time_is = "\nПоиск занял %s секунд"
    send_btns = "Посылаю кнопки"
    sucsessfully_deleted = 'Манга "{}" успешно удалена'
    start = 'start'
    you_already_have_this_manga = 'У вас уже есть эта манга - {}'

    updates_not_found = 'Нет обновлений'
    welcome = 'Привет!👋 Я бот который поможет тебе следить за большим количеством манги и ' \
              'сэкономить свое время. Я могу работать с readmanga и manga-chan!\n' + my_commands
    write_url = 'Введите ссылку на тайтл или /cancel чтобы отменить'
    write_manga_id_to_delete = 'Введите id манги которую хотите удалить или /cancel чтобы отменить'
